app/views/staffs/show.html.erb

SELECT  1 AS one FROM "info_staffs" WHERE "info_staffs"."staff_id" = ? LIMIT ?  [["staff_id", 1], ["LIMIT", 1]]
---
    <h2 class="categories-title"><%= @staff.content %></h2>
    <% if @staff.info_staffs.any? %>