app/views/staffs/staff.html.erb

		<h2 class="categories-title"><%= @staff.content %></h2>
		<% if @staff.info_staffs.any? %>
---
SELECT  1 AS one FROM "info_staffs" WHERE "info_staffs"."staff_id" = ? LIMIT ?  [["staff_id", 5], ["LIMIT", 1]]