app/views/temp_orders/_formByUser.html.erb

SELECT  "temp_orders".* FROM "temp_orders" WHERE "temp_orders"."user_id" = ? LIMIT ?  [["user_id", 101], ["LIMIT", 1]]
SELECT  1 AS one FROM "temp_order_items" WHERE "temp_order_items"."temp_order_id" = ? LIMIT ?  [["temp_order_id", 4], ["LIMIT", 1]]
SELECT "temp_order_items".* FROM "temp_order_items" WHERE "temp_order_items"."temp_order_id" = ?  [["temp_order_id", 4]]
---
  <div class="row">
    <% if temp_order.temp_order_items.any? %>