app/views/orders/_order.html.erb

SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 2]]
---
    <p style="width: 28%;"><%= order.book_time%></p>
    <p><%= order.order_items.count %></p>