app/views/orders/detail_order.html.erb

  <% end %>
  <h4><%= @order.order_items.count %> items</h4>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 2]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 2]]