app/views/orders/submittedOrder.html.erb

SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 2]]
---
				<span>Book time :<%= order.book_time%></span>
				<span><%= order.order_items.count %> items</span>