app/views/temp_order_items/_temp_order_item.html.erb

<li >
  <% menu_item = MenuItem.find(f.object.menu_item_id) %>
---
SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = ? ORDER BY "menu_items"."created_at" DESC LIMIT ?  [["id", 123], ["LIMIT", 1]]