app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def menu
    @categories = Category.all

SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."category_id" = ? ORDER BY "menu_items"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "menu_items" WHERE "menu_items"."category_id" = ?  [["category_id", 1]]
---
  def show
    store_location
    @menu_items = @category.menu_items.paginate(page: params[:page])

SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."category_id" = ? ORDER BY "menu_items"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "menu_items" WHERE "menu_items"."category_id" = ?  [["category_id", 1]]
---
  def category
    if params[:name]
      @menu_items = MenuItem.matching(:name, params[:name])
                    .where(category_id: @category.id)
                    .paginate(page: params[:page])

INSERT INTO "categories" ("content", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?)  [["content", "Food"], ["created_at", 2017-03-15 14:13:57 UTC], ["updated_at", 2017-03-15 14:13:57 UTC], ["image", "Food.jpg"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "content" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["content", "Food edited"], ["updated_at", 2017-03-14 13:41:11 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)