app/controllers/info_staffs_controller.rb

  def create
    @info_staff = InfoStaff.new(info_staff_params)

    respond_to do |format|
      if @info_staff.save
---
INSERT INTO "info_staffs" ("name", "age", "nation", "description", "Staff_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "d"], ["age", 1], ["nation", "e"], ["description", "e"], ["Staff_id", 1], ["created_at", 2017-03-19 13:42:22 UTC], ["updated_at", 2017-03-19 13:42:22 UTC]]

  def destroy
    binding.pry
    @info_staff.destroy
---
DELETE FROM "info_staffs" WHERE "info_staffs"."id" = ?  [["id", 2]]

    def set_info_staff
      @info_staff = InfoStaff.find(params[:id])
---
SELECT  "info_staffs".* FROM "info_staffs" WHERE "info_staffs"."id" = ? ORDER BY "info_staffs"."created_at" DESC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]