app/controllers/menu_items_controller.rb

SELECT "menu_items".* FROM "menu_items" ORDER BY "menu_items"."created_at" DESC
---
  def index
    @menu_items = MenuItem.all

INSERT INTO "menu_items" ("name", "price", "description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Bo Nhung Ot"], ["price", 10], ["description", ""], ["category_id", 1], ["created_at", 2017-03-14 11:21:40 UTC], ["updated_at", 2017-03-14 11:21:40 UTC]]
---
  def create
    @menu_item = MenuItem.new(menu_item_params)

    respond_to do |format|
      if @menu_item.save

UPDATE "menu_items" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "menu_items"."id" = ?  [["name", "Food 42 edited"], ["description", ""], ["updated_at", 2017-03-14 14:09:57 UTC], ["id", 43]]
---
  def update

    if @menu_item.update(menu_item_params)

DELETE FROM "menu_items" WHERE "menu_items"."id" = ?  [["id", 91]]
---
  def destroy
    @menu_item.destroy

SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = ? ORDER BY "menu_items"."created_at" DESC LIMIT ?  [["id", 91], ["LIMIT", 1]]
---
    def set_menu_item
      @menu_item = MenuItem.find(params[:id])