app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? ORDER BY "orders"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 101], ["LIMIT", 10], ["OFFSET", 0]]
---
  def submittedOrder
    @orders = Order.where(user_id: params[:id]).paginate(page: params[:page], per_page: 10)
                                                .order(created_at: :desc)

UPDATE "orders" SET "paid" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["paid", true], ["updated_at", 2017-03-20 16:38:07 UTC], ["id", 2]]
---
  def pay
    admin?(params[:user_id])
    @order.paid = true
    if @order.save