app/controllers/staffs_controller.rb

SELECT "staffs".* FROM "staffs"
---
  def index
    @staffs = Staff.all

SELECT "staffs".* FROM "staffs"
---
  def list
    @staffs=  Staff.all

SELECT  "info_staffs".* FROM "info_staffs" WHERE "info_staffs"."staff_id" = ? ORDER BY "info_staffs"."created_at" DESC LIMIT ? OFFSET ?  [["staff_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "info_staffs" WHERE "info_staffs"."staff_id" = ?  [["staff_id", 1]]
---
  def show
    store_location
    @info_staffs = @staff.info_staffs.paginate(page: params[:page])

INSERT INTO "staffs" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "Casher"], ["created_at", 2017-03-19 09:32:09 UTC], ["updated_at", 2017-03-19 09:32:09 UTC]]
---
  def create
    @staff = Staff.new(staff_params)

    respond_to do |format|
      if @staff.save

DELETE FROM "info_staffs" WHERE "info_staffs"."id" = ?  [["id", 16]]
DELETE FROM "staffs" WHERE "staffs"."id" = ?  [["id", 2]]
---
  def destroy
    @staff.destroy

SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "info_staffs".* FROM "info_staffs" WHERE "info_staffs"."staff_id" = ? ORDER BY "info_staffs"."created_at" DESC  [["staff_id", 2]]
---
    def set_staff
      @staff = Staff.find(params[:id])