app/controllers/tables_controller.rb

SELECT "tables".* FROM "tables"
---
  def index
    @tables = Table.all

INSERT INTO "tables" ("no", "beingUsed?", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["no", 1], ["beingUsed?", false], ["created_at", 2017-03-19 09:30:55 UTC], ["updated_at", 2017-03-19 09:30:55 UTC]]
---
  def create
    pr = table_params
    if pr[:beingUsed?].nil?
      pr[:beingUsed?] = false
    end
    @table = Table.new(pr)

    respond_to do |format|
      if @table.save

DELETE FROM "tables" WHERE "tables"."id" = ?  [["id", 1]]
---
  def destroy
    @table.destroy

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_table
      @table = Table.find(params[:id])