app/controllers/temp_orders_controller.rb

SELECT "temp_orders".* FROM "temp_orders"
---
  def index
    @temp_orders = TempOrder.all

SELECT  "temp_orders".* FROM "temp_orders" WHERE "temp_orders"."user_id" = ? LIMIT ?  [["user_id", 101], ["LIMIT", 1]]
SELECT "tables".* FROM "tables"
---
  def newByUser
    @temp_order = TempOrder.find_by(user_id: params[:id])
    tables = Table.all

INSERT INTO "temp_orders" ("user_id", "table_id", "created_at", "updated_at", "book_time") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["table_id", 3], ["created_at", 2017-03-19 09:46:32 UTC], ["updated_at", 2017-03-19 09:46:32 UTC], ["book_time", 2017-03-19 09:00:00 UTC]]
---
  def create
    @temp_order = TempOrder.new(temp_order_params)

    if params[:create_or_update]
      if @temp_order.save

UPDATE "temp_orders" SET "table_id" = ?, "book_time" = ?, "updated_at" = ? WHERE "temp_orders"."id" = ?  [["table_id", 8], ["book_time", 2017-03-15 13:00:00 UTC], ["updated_at", 2017-03-19 14:37:33 UTC], ["id", 4]]
---
  def update
    if params[:create_or_update]
      if @temp_order.update(temp_order_params)

DELETE FROM "temp_orders" WHERE "temp_orders"."id" = ?  [["id", 2]]
---
  def destroy
    @temp_order.destroy

DELETE FROM "temp_orders" WHERE "temp_orders"."id" = ?  [["id", 7]]
---
  def clear
    if @temp_order.destroy!

SELECT  "temp_orders".* FROM "temp_orders" WHERE "temp_orders"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
---
    def set_temp_order
      @temp_order = TempOrder.find(params[:id])