app/controllers/temp_order_items_controller.rb

  def create
    pr = order_item_params
    cu = current_user
    to = cu.temp_order

    unless to
      tb = Table.first
      to = TempOrder.create(user_id: cu.id, table_id: tb.id, book_time: Time.now)
      item = TempOrderItem.new(menu_item_id: pr[:menu_item_id], quantity: 1, temp_order_id: to.id)
    else
      item = TempOrderItem.find_by(menu_item_id: pr[:menu_item_id], temp_order_id: to.id)
      if item
        item.quantity += 1
      else
        item = TempOrderItem.new(menu_item_id: pr[:menu_item_id], quantity: 1, temp_order_id: to.id)
      end
    end

    if item.save
---
SELECT  "tables".* FROM "tables" ORDER BY "tables"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "temp_orders" ("user_id", "table_id", "created_at", "updated_at", "book_time") VALUES (?, ?, ?, ?, ?)  [["user_id", 102], ["table_id", 3], ["created_at", 2017-03-19 18:14:35 UTC], ["updated_at", 2017-03-19 18:14:35 UTC], ["book_time", 2017-03-19 18:14:35 UTC]]
SELECT  "temp_order_items".* FROM "temp_order_items" WHERE "temp_order_items"."menu_item_id" = ? AND "temp_order_items"."temp_order_id" = ? LIMIT ?  [["menu_item_id", 123], ["temp_order_id", 4], ["LIMIT", 1]]
INSERT INTO "temp_order_items" ("menu_item_id", "quantity", "created_at", "updated_at", "temp_order_id") VALUES (?, ?, ?, ?, ?)  [["menu_item_id", 124], ["quantity", 1], ["created_at", 2017-03-19 18:11:09 UTC], ["updated_at", 2017-03-19 18:11:09 UTC], ["temp_order_id", 4]]
UPDATE "temp_order_items" SET "quantity" = ?, "updated_at" = ? WHERE "temp_order_items"."id" = ?  [["quantity", 4], ["updated_at", 2017-03-19 18:09:15 UTC], ["id", 10]]

  def destroy
    @temp_order_item.destroy
---
DELETE FROM "temp_order_items" WHERE "temp_order_items"."id" = ?  [["id", 9]]

    def set_temp_order_item
      @temp_order_item = TempOrderItem.find(params[:id])
---
SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = ? ORDER BY "menu_items"."created_at" DESC LIMIT ?  [["id", 123], ["LIMIT", 1]]
SELECT  "temp_order_items".* FROM "temp_order_items" WHERE "temp_order_items"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]