app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ? OFFSET ?  [["email", "xivecto@gmail.com"], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."email" = ?  [["email", "xivecto@gmail.com"]]
---
  def index
    if params[:email]
      @users = User.matching(:email, params[:email]).paginate(page: params[:page])

UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "hieuvectodeptrai"], ["password_digest", "$2a$10$TrY1xEOMnsRhliXxwmh1kenWYchdGzZucDQcHsFDBhCkxN.T0IdRy"], ["updated_at", 2017-03-13 15:19:46 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)