app/views/categories/category.html.erb

		<h2 class="categories-title"><%= @category.content %></h2>
		<% if @category.menu_items.any? %>
---
SELECT  1 AS one FROM "menu_items" WHERE "menu_items"."category_id" = ? LIMIT ?  [["category_id", 4], ["LIMIT", 1]]