app/views/categories/show.html.erb

  <div class="col-md-8">
    <% if @category.menu_items.any? %>
---
SELECT  1 AS one FROM "menu_items" WHERE "menu_items"."category_id" = ? LIMIT ?  [["category_id", 1], ["LIMIT", 1]]